Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: This is the value of @code{abbrev-mode} for buffers that do not override it. This is the same as @code{(default-value 'abbrev-mode)}.
fr_fr: C'est la valeur de @code{abbrev-mode} pour les tampons qui ne la modifient pas. C'est identique à @code{(default-value 'abbrev-mode)}.

source: This makes @var{string} a unibyte string and clears its contents to zeros. It may also change @var{string}'s length.
fr_fr: Cela fait de @var{string} une chaîne uni-octet et efface le contenu en l'amenant à 0. Cela peut aussi changer la longueur de @var{string}.

source: This manual attempts to be a full description of Emacs Lisp. For a beginner's introduction to Emacs Lisp, see @cite{An Introduction to Emacs Lisp Programming}, by Bob Chassell, also published by the Free Software Foundation. This manual presumes considerable familiarity with the use of Emacs for editing; see @cite{The GNU Emacs Manual} for this basic information.
fr_fr: Ce manuel essaye d'être une description complète d'Emacs Lisp. Pour la présentation à un débutant d'Emacs Lisp, voir @cite{An Introduction to Emacs Lisp Programming}, par Bob Chassell, également édité par la Free Software Foundation. Ce manuel suppose la connaissance parfaite de l'utilisation d'Emacs pour l'édition ; voir @cite{The GNU Emacs Manual} pour cette information de base.

source: This manual describes Emacs Lisp. Generally speaking, the earlier chapters describe features of Emacs Lisp that have counterparts in many programming languages, and later chapters describe features that are peculiar to Emacs Lisp or relate specifically to editing.
fr_fr: Ce manuel traite d'Emacs Lisp. D'une manière générale, les premiers chapitres décrivent les caractéristiques d'Emacs Lisp communes de nombreux langages de programmation, tandis que les chapitres suivants décrivent les caractéristiques particulières d'Emacs Lisp ou encore celles qui se réfèrent spécifiquement à l'édition.

source: This manual has gone through numerous drafts. It is nearly complete but not flawless. There are a few topics that are not covered, either because we consider them secondary (such as most of the individual modes) or because they are yet to be written. Because we are not able to deal with them completely, we have left out several parts intentionally. This includes most information about usage on VMS.
fr_fr: Ce manuel est passé par de nombreuses ébauches. Il est presque complet mais non impeccable. Il y a quelques sujets qui ne sont pas couverts parce que nous les considérons secondaires (comme la plupart des différents modes) ou parce qu'ils doivent encore être écrits. Puisque nous ne pouvons pas les traiter complètement, nous avons omis plusieurs parties intentionnellement. Ceci inclut la plupart des informations sur l'utilisation de VMS.

source: This manual was written by Robert Krawitz, Bil Lewis, Dan LaLiberte, Richard@tie{}M. Stallman and Chris Welty, the volunteers of the GNU manual group, in an effort extending over several years. Robert@tie{}J. Chassell helped to review and edit the manual, with the support of the Defense Advanced Research Projects Agency, ARPA Order 6082, arranged by Warren@tie{}A. Hunt, Jr.@: of Computational Logic, Inc.
fr_fr: Ce manuel a été écrit par Robert Krawitz, Bil Lewis, Dan LaLiberte, Richard M. Stallman and Chris Welty, les volontaires du groupe GNU manual, dans un effort se prolongeant sur plusieurs années. Robert J. Chassell a aidé à passer en revue et éditer le manuel, avec l'appui de la Defense Advanced Research Projects Agency, ARPA Ordre 6082, avec l'accord de Warren A. Hunt, Jr.@: de Computational Logic, Inc.

source: This predicate returns non-@code{nil} if @var{object} is a valid case table.
fr_fr: Ce prédicat retourne non-@code{nil} si @var{object} est une tableau de casse valide.

source: This predicate tests whether its argument is a floating point number and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre à virgule flottante et renvoie @code{t} si oui, @code{nil} autrement.

source: This predicate tests whether its argument is a number (either integer or floating point), and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre (nombre entier ou virgule flottante), et renvoie le @code{t} si oui, @code{nil} autrement.

source: This predicate tests whether its argument is an integer, and returns @code{t} if so, @code{nil} otherwise.
fr_fr: Cet attribut examine si son argument est un nombre entier, et renvoie le @code{t} si oui, @code{nil} autrement.

source: This predicate tests whether its argument is zero, and returns @code{t} if so, @code{nil} otherwise. The argument must be a number.
fr_fr: Cet attribut examine si son argument est zéro, et renvoie @code{t} si oui, @code{nil} autrement. L'argument doit être un nombre.

source: This returns @code{t} if @var{object} is a bool-vector, and @code{nil} otherwise.
fr_fr: Retourne @code{t} si @var{object} est un vecteur-booléen, et sinon @code{nil}.

source: This returns @var{number} converted to floating point. If @var{number} is already a floating point number, @code{float} returns it unchanged.
fr_fr: Ceci renvoie @var{number} converti en un nombre à virgule flottante. Si @var{number} est déjà un nombre à virgule flottante, @code{float} le renvoie sans changement.

source: This returns @var{number}, converted to an integer by rounding downward (towards negative infinity).
fr_fr: Ceci renvoie @var{number}, converti en nombre entier en arrondissant en bas (vers moins l'infini).

source: This returns @var{number}, converted to an integer by rounding towards the nearest integer. Rounding a value equidistant between two integers may choose the integer closer to zero, or it may prefer an even integer, depending on your machine.
fr_fr: Ceci renvoie @var{number}, converti en nombre entier arrondi vers le nombre entier le plus proche. L'arrondi d'une valeur équidistante entre deux nombres entiers peut choisir le nombre entier plus près de zéro, ou il peut préférer un nombre entier équivalent, selon votre machine.

source: This returns @var{number}, converted to an integer by rounding towards zero.
fr_fr: Ceci renvoie @var{number}, converti en nombre entier arrondis vers zéro.

source: This returns @var{number}, converted to an integer by rounding upward (towards positive infinity).
fr_fr: Ceci renvoie @var{number}, converti en nombre entier en arrondissant vers le haut (vers plus l'infini).

source: This returns a string containing the characters @var{characters}.
fr_fr: Cette fonction retourne une chaîne contenant les caractères @var{caracteres}.

source: This returns non-@code{nil} if @var{table} is a hash table object.
fr_fr: Cette fonction retourne non-@code{nil} si @var{table} est un objet de type table de hachage.

source: This returns the @var{test} value that was given when @var{table} was created, to specify how to hash and compare keys. See @code{make-hash-table} (@pxref{Creating Hash}).
fr_fr: Cette fonction retourne la valeur @var{test} qui a été donnée quand @var{table} fut créée pour spécifier comment hacher et comparer les clés. Voir @code{make-hash-table} (@pxref{Creating Hash}).

source: This returns the current nominal size of @var{table}.
fr_fr: Cette fonction retourne la valeur nominale actuelle de @var{table}.

source: This returns the rehash size of @var{table}.
fr_fr: Cette fonction retourne la valeur de la taille d'agrandissement (@code{rehash-size}) de @var{table}.

source: This returns the rehash threshold of @var{table}.
fr_fr: Cette fonction retourne la valeur seuil de re-hachage (@code{rehash threshold}) de @var{table}.

source: This returns the square root of @var{arg}. If @var{arg} is negative, it signals a @code{domain-error} error.
fr_fr: Ceci renvoie la racine carrée de @var{arg}. Si @var{arg} est négatif, il signale une erreur @code{domain-error}.

source: This returns the standard case table.
fr_fr: Cette fonction retourne le tableau de casse normale.

source: This returns the value specified in @var{char-table} for a range of characters @var{range}. Here are the possibilities for @var{range}:
fr_fr: Cette fonction retourne la valeur spécifiée dans @var{char-table} pour la gamme de caractères @var{range}. Voici les valeurs possibles de @var{range} :

source: This section describes functions for conversions between characters, strings and integers. @code{format} (@pxref{Formatting Strings}) and @code{prin1-to-string} (@pxref{Output Functions}) can also convert Lisp objects into strings. @code{read-from-string} (@pxref{Input Functions}) can ``convert'' a string representation of a Lisp object into an object. The functions @code{string-make-multibyte} and @code{string-make-unibyte} convert the text representation of a string (@pxref{Converting Representations}).
fr_fr: Cette section décrit les fonctions de conversions entre les caractères, les chaînes et les entiers. @code{format} (@pxref{Formatting Strings}) et @code{prin1-to-string} (@pxref{Output Functions}) peuvent également convertir les objets Lisp en chaînes. @code{read-from-string} (@pxref{Input Functions}) peut "convertir" en un objet la représentation sous forme de chaîne d'un objet List. Les fonctions @code{string-make-multibyte} et @code{string-make-unibyte} convertissent la représentation textuelle d'une chaîne (@pxref{Converting Representations}).

source: This section describes how to create and manipulate abbrev tables.
fr_fr: Cette section décrit comment créer et manipuler des tables d'abréviations.

source: This section describes the functions for accessing and storing associations in a hash table. In general, any Lisp object can be used as a hash key, unless the comparison method imposes limits. Any Lisp object can also be used as the value.
fr_fr: Cette section décrit les fonctions pour accéder et stocker des associations dans une table de hachage. En général, tout objet Lisp peut être utilisé en tant que clé de hachage, sauf si la méthode de comparaison impose des limites. Tout objet Lisp peut aussi être utilisé comme valeur.

source: This section explains the notational conventions that are used in this manual. You may want to skip this section and refer back to it later.
fr_fr: Cette section explique les conventions d'écriture qui sont employées dans ce manuel. Vous pouvez sauter cette section et vous y référer plus tard.

source: This sets the current buffer's case table to @var{table}.
fr_fr: Cette fonction définit le tableau de casse courante du tampon à la valeur @var{table}.

source: This specifies a hint for how many associations you plan to store in the hash table. If you know the approximate number, you can make things a little more efficient by specifying it this way. If you specify too small a size, the hash table will grow automatically when necessary, but doing that takes some extra time.
fr_fr: C'est une astuce qui permet de spécifier le nombre d'associations que vous prévoyez de stocker dans la table de hachage. Si vous connaissez le nombre approximatif, vous pouvez rendre les choses un peu plus efficaces en le spécificant de cette façon. Si vous spécifiez une taille trop petite, la table de hachage s'agrandira automatiquement quand ce sera nécessaire mais cela prendra du temps supplémentaire.

source: This specifies the criterion for when the hash table is ``full'' (so it should be made larger). The value, @var{threshold}, should be a positive floating point number, no greater than 1. The hash table is ``full'' whenever the actual number of entries exceeds this fraction of the nominal size. The default for @var{threshold} is 0.8.
fr_fr: Spécifie le critère pour qu'une table de hachage soit ``pleine'' (Il faut donc qu'il soit défini comme plus grand). La valeur @var{threshold} doit être soit un nombre positif à virgule flottante et inférieur ou égal à 1. La table de hachage est ``pleine'' dès que le nombre d'entrées dépasse cette fraction de la taille nominale. La valeur par défaut pour @var{threshold} est 0.8.

source: This specifies the method of key lookup for this hash table. The default is @code{eql}; @code{eq} and @code{equal} are other alternatives:
fr_fr: Spécifie la méthode de recherche de la clé pour cette table de hachage. La valeur par défaut est @code{eql} ; @code{eq} et @code{equal} sont également possibles :

source: This variable automatically becomes buffer-local when set in any fashion.
fr_fr: Cette variable devient automatiquement locale au tampon quand elle est activée dans n'importe quelle mode.

source: This works like @code{substring} but discards all text properties from the value. Also, @var{start} may be omitted or @code{nil}, which is equivalent to 0. Thus, @w{@code{(substring-no-properties @var{string})}} returns a copy of @var{string}, with all text properties removed.
fr_fr: Cela fonctionne comme @code{substring} mais rejette toutes les propriétés du texte en valeur. De même, @var{start} peut être omis ou @code{nil}, qui est équivalent à 0. Donc, @w{@code{(substring-no-properties @var{string})}} retourne une copie de @var{string}, en enlevant toutes les propriétés textuelles.

source: Throughout this manual, the phrases ``the Lisp reader'' and ``the Lisp printer'' refer to those routines in Lisp that convert textual representations of Lisp objects into actual Lisp objects, and vice versa. @xref{Printed Representation}, for more details. You, the person reading this manual, are thought of as ``the programmer'' and are addressed as ``you.'' ``The user'' is the person who uses Lisp programs, including those you write.
fr_fr: Dans tout ce manuel, les expressions « le lecteur de Lisp » et « l'afficheur de Lisp » se rapportent à ces routines en Lisp qui convertissent les représentations textuelles du Lisp object en objets réels de Lisp, et vice-versa. @xref{Printed Representation}, pour plus de détails. Vous, la personne lisant ce manuel, êtes considérée comme « programmeur » et êtes nommée en tant que « vous ». « L'utilisateur » est la personne qui emploie le Lisp des programmes, y compris ceux que vous écrivez.

source: Thus, to define a new method of key lookup, you need to specify both a function to compute the hash code from a key, and a function to compare two keys directly.
fr_fr: Ainsi donc, pour définir une nouvelle méthode de recherche de clé, il faut spécifier à la fois une fonction pour calculer le code de hachage à partir d'une clé et la fonction pour comparer directement deux clés.

source: Thus, with @code{ash}, shifting the pattern of bits one place to the right looks like this:
fr_fr: Ainsi, @code{ash}, décalant la combinaison de chiffres binaires d'une place vers la droite ressemble à ceci:

source: Tips
fr_fr: Astuces

source: To clear out a string that contained a password, use @code{clear-string}:
fr_fr: Pour effacer une chaîne qui contient un mot de passe, utilisez @code{clear-string} :

source: To convert an integer to floating point, use the function @code{float}.
fr_fr: Pour convertir un nombre entier en un nombre à virgule flottante, employez la fonction @code{float}.

source: To test numbers for numerical equality, you should normally use @code{=}, not @code{eq}. There can be many distinct floating point number objects with the same numeric value. If you use @code{eq} to compare them, then you test whether two values are the same @emph{object}. By contrast, @code{=} compares only the numeric values of the objects.
fr_fr: Pour tester l'égalité numérique des nombres, vous devriez normalement employer @code{=}, pas @code{eq}. Il peut y avoir beaucoup d'objets distincts de nombre à virgule flottante avec la même valeur numérique. Si vous employez @code{eq} pour les comparer, vous testez si deux valeurs sont des @emph{objets} identiques. En revanche, @code{=} compare seulement les valeurs numériques des objets.

source: To test whether a floating point value is a NaN, compare it with itself using @code{=}. That returns @code{nil} for a NaN, and @code{t} for any other floating point value.
fr_fr: Pour examiner si une valeur à virgule flottante est NaN, le comparer à lui-même en employant @code{=}. Il renvoie @code{nil} pour NaN, et @code{t} pour n'importe quelle autre valeur à virgule flottante.

source: To understand how various functions work on integers, especially the bitwise operators (@pxref{Bitwise Operations}), it is often helpful to view the numbers in their binary form.
fr_fr: Pour comprendre comment les diverses fonctions travaillent sur des nombres entiers, particulièrement au niveau du bit des opérateurs (@pxref{Opérations de bits}), il est souvent utile de regarder les nombres sous leur forme binaire.

source: Tools and tips for debugging Lisp programs.
fr_fr: Outils et astuces pour le débogage de programmes Lisp.

source: Trig, exponential and logarithmic functions.
fr_fr: Fonctions trigonométrique, exponentielle et logarithmique.

source: Two Lisp objects are ``the same,'' as keys, if they are equal according to @code{equal}.
fr_fr: Deux objets Lisp sont ``les mêmes'', en tant que clés, s'ils sont égaux d'après la fonction @code{equal}.

source: Type Predicates for Numbers
fr_fr: Type d'attributs des nombres

source: Unlike @code{%}, @code{mod} returns a well-defined result for negative arguments. It also permits floating point arguments; it rounds the quotient downward (towards minus infinity) to an integer, and uses that quotient to compute the remainder.
fr_fr: À la différence de @code{%}, @code{mod} renvoie un résultat bien défini pour les arguments négatifs. Il permet également des arguments à virgule flottante ; il arrondit le quotient à un nombre entier vers le bas (vers moins l'infini), et utilise ce quotient pour calculer le reste.

source: User option descriptions have the same format, but `Variable' is replaced by `User Option'.
fr_fr: Les descriptions d'option d'utilisateur ont le même format, mais le mot `Variable' est remplacée par `User Option'.

source: Using symbols in programs to stand for values.
fr_fr: Utilisation de symboles dans des programmes à la place de valeurs.

source: Using the minibuffer to read input.
fr_fr: Utilisation du minibuffer pour la lecture de l'entrée.

source: Value
fr_fr: Valeur

source: Vector Functions
fr_fr: Fonctions pour les vecteurs

source: Vectors
fr_fr: Vecteurs

source: Vectors are printed with square brackets surrounding the elements. Thus, a vector whose elements are the symbols @code{a}, @code{b} and @code{a} is printed as @code{[a b a]}. You can write vectors in the same way in Lisp input.
fr_fr: Les vecteurs s'affichent avec les éléments entre crochets. Ainsi, un vecteur dont les éléments sont les symboles @code{a}, @code{b} et @code{a} s'affiche de la façon suivante @code{[a b a]}. On peut écrire des vecteurs de la même façon en saisie Lisp.

source: Version 1.2, November 2002
fr_fr: Version 1.2, novembre 2002

source: Version Info
fr_fr: Information de version

source: Version Information
fr_fr: Information de version

source: We let mail to this list accumulate unread until someone decides to apply the corrections. Months, and sometimes years, go by between updates. So please attach no significance to the lack of a reply---your mail @emph{will} be acted on in due time. If you want to contact the Emacs maintainers more quickly, send mail to @code{bug-gnu-emacs@@gnu.org}.
fr_fr: Nous laissons le courrier non lu de cette liste s'accumuler jusqu'à ce que quelqu'un décide d'appliquer les corrections. Les mois, et parfois les années, s'écoulent entre les mises à jour. Veuillez ne pas attacher de signification au manque d'une réponse---votre courrier @emph{devrait} être pris en compte en temps voulu. Si vous voulez contacter la maintenance d'Emacs plus rapidement, envoyer le courrier à @code{bug-gnu-emacs@@gnu.org}.

source: We often refer to ``the function @code{foo}'' when we really mean the function stored in the function cell of the symbol @code{foo}. We make the distinction explicit only when necessary. In normal usage, the function cell usually contains a function (@pxref{Functions}) or a macro (@pxref{Macros}), as that is what the Lisp interpreter expects to see there (@pxref{Evaluation}). Keyboard macros (@pxref{Keyboard Macros}), keymaps (@pxref{Keymaps}) and autoload objects (@pxref{Autoloading}) are also sometimes stored in the function cells of symbols.
fr_fr: On fait souvent référence à ``la fonction @code{foo}'' alors qu'en réalité il s'agit de la fonction stockée dans la cellule de fonction du symbole @code{foo}. On fait la distinction explicitement seulement quand c'est nécessaire. Dans une utilisation normale, en général la cellule de fonction contient une fonction (@pxref{Functions}) ou une macro (@pxref{Macros}), conformément à ce que l'interpréteur Lisp s'attend à voir là (@pxref{Evaluation}). Les macros de clavier (@pxref{Keyboard Macros}), les mappages claviers (@pxref{Keymaps}) et les objets auto-chargeables (@pxref{Autoloading}) sont aussi parfois stockés dans les cellules de fonction des symboles.

source: When @code{nil} is used for @var{end}, it stands for the length of the string. Thus,
fr_fr: Lorsque @code{nil} est utilisé pour @var{end}, il correspond à la longueur de la chaîne. Donc,

source: When a form is a macro call, it expands into a new form for Lisp to evaluate. We show the result of the expansion with @samp{@expansion{}}. We may or may not show the result of the evaluation of the expanded form.
fr_fr: Quand un formulaire est appellé par une macro, il augmente d'un nouveau formulaire pour que le Lisp l'évalue. Nous montrons le résultat de l'expansion avec @samp{@expansion{}}. Nous pouvons ou non montrer le résultat de l'évaluation du formulaire augmenté.

source: When the argument to @code{capitalize} is a character, @code{capitalize} has the same result as @code{upcase}.
fr_fr: Quand l'argument pour @code{capitalize} est un caractère, @code{capitalize} a le même résultat que @code{upcase}.

source: When the argument to @code{downcase} is a string, the function creates and returns a new string in which each letter in the argument that is upper case is converted to lower case. When the argument to @code{downcase} is a character, @code{downcase} returns the corresponding lower case character. This value is an integer. If the original character is lower case, or is not a letter, then the value equals the original character.
fr_fr: Quand l'argument pour @code{downcase} est une chaîne, la fonction crée et retourne une nouvelle chaîne dans laquelle chaque lettre de l'argument qui est en majuscule est convertie en minuscule. Quand l'argument pour @code{downcase} est un caractère, @code{downcase} retourne le caractère minuscule correspondant. Cette valeur est un entier. Si le caractère d'origine est en minuscule, ou s'il n'est pas une lettre, alors la valeur est égale au caractère d’origine.

source: When the argument to @code{upcase-initials} is a character, @code{upcase-initials} has the same result as @code{upcase}.
fr_fr: Quand l'argument pour @code{upcase-initials} est un caractère, @code{upcase-initials} a le même résultat que @code{upcase}.

source: When the argument to @code{upcase} is a character, @code{upcase} returns the corresponding upper case character. This value is an integer. If the original character is upper case, or is not a letter, then the value returned equals the original character.
fr_fr: Quand l'argument pour @code{upcase} est un caractère, @code{upcase} retourne la caractère majuscule correspondant. Cette valeur est un entier. Si le caractère d’origine est en majuscule, ou si n'est pas une lettre, alors la valeur est égale au caractère d’origine.
